import {test, expect, chromium} from '@playwright/test';

test('chapter 3', async () => {
    test.setTimeout(60 * 60 * 1000);
    const browser = await chromium.connectOverCDP('http://localhost:9222');

    const context = browser.contexts()[0];
    const page = await context.newPage()

    await page.goto('https://gemini.google.com/app/9e9deef3f838d0c1?is_sa=1&is_sa=1&android-min-version=301356232&ios-min-version=322.0&campaign_id=bkws&utm_source=sem&utm_medium=paid-media&utm_campaign=bkws&pt=9008&mt=8&ct=p-growth-sem-bkws&gclsrc=aw.ds&gad_source=1&gad_campaignid=20108148187&gbraid=0AAAAApk5Bhmqlrn-BCSisCYXxaZtgzLHd&gclid=CjwKCAjwqubPBhBOEiwAzgZX2mHmDzUPwNJQGzKsnB3ZDQ-06nwfM0hOExOTd2243kHjBIdPEweAaxoCTakQAvD_BwE');
    // await page.goto('https://gemini.google.com/app/15398d542d1e8e37');

    const list = ``
        .split('\n')

    for (let index = 25; index < list.length; index++) {
        const str = list[index]
        console.log(`processing ${index}: ${str}`);
        await page.locator('rich-textarea div p').fill(str);

        await page.waitForTimeout(2000);
        await page.locator('input-container button').last().click();

        await page.waitForTimeout(6000);
        console.log(`processed ${index}: ${str}`);
    }
    // const copiedText = await page.evaluate(() => navigator.clipboard.readText());
    // console.log(copiedText);
});


function main() {
    `अथातो रोगानुत्पादनीयाध्यायं व्याख्यास्याम: । इति ह स्माहुरात्रेयादयो महर्षय: । 
॥ १ ॥ वेगान्न धारयेद्वातविण्मूत्रक्षवत्तृट्क्षुधाम् । निद्राकासश्रमश्वासजृम्भाश्रुच्छर्दिरितसाम् ॥
॥ २ ॥ अधोवातस्य रोधेन गुल्मोदावर्तरुक्क्लमा: । वातमूत्रशकृत्सङ्गदृष्ट्यग्निवधहृद्गदा: ॥
॥ ३ ॥ शकृत: पिण्डिकोद्वेष्टप्रतिश्यायशिरोरुज: । ऊर्ध्ववायु: परिकर्तो हृदयस्योपरोधनम् ॥
॥ ४ ॥ मुखेन विट्प्रवृत्तिश्च पूर्वोक्ताश्चामया: स्मृता: । अङ्गभङ्गश्मरीबस्तिमेढ्रवङ्क्षणवेदना: ॥
॥ ५ ॥ मूत्रस्य रोधात्पूर्वे च प्रायो रोगा:——तदौषधम् । वर्त्यभ्यङ्गावगाहाश्च स्वेदनं बस्तिकर्म च ॥
॥ ६ ॥ अन्नपानं च विड्भेदि विड्रोधोत्थेषु यक्ष्मसु । मूत्रजेषु तु पाने च प्राग्भक्तं शस्यते घृतम् ॥
॥ ७ ॥ जीर्णान्तिकं चोत्तमया मात्रया योजनाद्वयम् । अवपीडकमेतच्च संज्ञितं——धारणात्पुन: ॥
॥ ८ ॥ उद्गारस्यारुचि: कम्पो विबन्धो हृदयोरसो: । आध्मानकासहिध्माश्च हिध्मावत्तत्र भेषजम् ॥
॥ ९ ॥ शिरोऽर्त्तीन्द्रियदौर्बल्यमन्यास्तम्भार्दितं क्षुते: । तीक्ष्णधूमाञ्जनाघ्राणनावनार्कविलोकनैः ॥
॥ १० ॥ प्रवर्तयेत्क्षुतिं सक्तां स्नेहस्वेदौ च शीलयेत् । शोषाङ्गसादबाधिर्यसम्मोहभ्रमहृद्गदाः ॥
॥ ११ ॥ तृष्णाया निग्रहात्तत्र शीतः सर्वो विधिर्हितः । अङ्गभङ्गरुचिग्लानिकार्श्यशूलभ्रमाः क्षुधः ॥
॥ १२ ॥ तत्र योज्यं लघु स्निग्धमुष्णमल्पं च भोजनम् । निद्राया मोहमूर्धाक्षिगौरवालस्यजृम्भिकाः ॥
॥ १३ ॥ अङ्गमर्दश्च, तत्रेष्टः स्वप्नः संवाहनानि च । कासस्य रोधात्तद्वृद्धिः श्वासारुचिहृदामयाः ॥
॥ १४ ॥ शोषो हिक्मा च, कार्योऽत्र कासहा सुतरां विधिः । गुल्महृद्रोगसम्मोहाः श्रमश्वासाद्विधारितात् ॥
॥ १५ ॥ हितं विश्रमणं तत्र वातघ्नश्च क्रियाक्रमः । जृम्भायाः क्षववद्रोगाः, सर्वश्चानिलजिद्विधिः ॥
॥ १६ ॥ पीनसाक्षिशिरोहृद्रुङ्मन्ण्यास्तम्भारुचिभ्रमाः । सगुल्मा बाष्पतस्तत्र स्वप्नो मद्यं प्रियाः कथाः ॥
॥ १७ ॥ विसर्पकोठकुष्ठाक्षिकण्डूपाण्ड्वामयज्वराः । सकासश्वासहृल्लासव्यङ्गश्वयथवो वमेः ॥
॥ १८ ॥ गण्डूषधूमानाहारा रूक्षं भुक्त्वा तदुद्गमः । व्यायामः स्रुतिरस्त्रस्य शस्तं चात्र विरेचनम् ॥
॥ १९ ॥ सक्षारलवणं तैलमभ्यङ्गार्थं च शस्यते । शुक्रात्तत्स्रवणं गुह्यवेदनाश्वयथुज्वराः ॥
॥ २० ॥ हृद्व्यथामूत्रसङ्गाङ्गभङ्गवृद्ध्यश्मषण्डताः । ताम्रचूडसुराशालिबस्त्यभ्यङ्गवगाहनम् ॥
॥ २१ ॥ बस्तिशुद्धिकरैः सिद्धं भजेत्क्षीरं प्रियाः स्त्रियः । तृट्शूलार्तं त्यजेत् क्षीणं विड्वमं वेगरोधिनम् ॥
॥ २२ ॥ रोगाः सर्वेऽपि जायन्ते वेगोदीरणधारणैः । निर्दिष्टं साधनं तत्र भूयिष्ठं ये तु तान् प्रति ॥
॥ २३ ॥ ततश्चानेकधा प्रायः पवनो यत्प्रकुप्यति । अन्नपानौषधं तस्य युञ्जीतातस्त्वनुलोमनम् ॥
॥ २४ ॥ धारयेत्तु सदा वेगान् हितैषी प्रेत्य चेह च । लोभेर्ष्याद्वेषमात्सर्यरागादीनां जितेन्द्रियः ॥
॥ २५ ॥ यतेत च यथाकालं मलानां शोधनं प्रति । अत्यर्थसञ्चितास्ते हि क्रुद्धाः स्युर्जीवितच्छिदः ॥
॥ २६ ॥ दोषाः कदाचित्कुप्यन्ति जिता लङ्घनपाचनैः । ये तु संशोधनैः शुद्धा न तेषां पुनरुद्भवः ॥
॥ २७ ॥ यथाक्रमं यथायोगमत ऊर्ध्वं प्रयोजयेत् । रसायनानि सिद्धानि वृष्ययोगांश्च कालवित् ॥
॥ २८ ॥ भेषजक्षपिते पथ्यमाहारैर्बृंहणं क्रमात् । शालिषष्टिकगोधूममुद्गमांसघृतादिभिः ॥
॥ २९ ॥ हृद्यदीपनभैषज्यसंयोगाद्रुचिपक्तिदैः । साभ्यङ्गोद्वर्तनस्नाननिरूहस्नेहबस्तिभिः ॥
॥ ३० ॥ तथा स लभते शर्म सर्वपावकपाटवम् । धीवर्णेन्द्रियवैमल्यं वृषतां दैर्घ्यमायुषः ॥
॥ ३१ ॥ ये भूतविषवाय्वग्निक्षतभङ्गादिसम्भवाः । रागद्वेषभयाद्याश्च ते स्युरागन्तवो गदाः ॥
॥ ३२ ॥ त्यागः प्रज्ञापराधानामिन्द्रियोपशमः स्मृतिः । देशकालात्मविज्ञानं सद्वृत्तस्यानुवर्तनम् ॥
॥ ३३ ॥ अथर्वविहिता शान्तिः प्रतिकूलग्रहार्चनम् । भूताद्यस्पर्शनोपायो निर्दिष्टश्च पृथक् पृथक्॥
॥ ३४ ॥ अनुत्पत्त्यै समासेन विधिरेषः प्रदर्शितः । निजागन्तुविकाराणामुत्पन्नानां च शान्तये ॥
॥ ३५ ॥ शीतोद्भवं दोषचयं वसन्ते विशोधयन् ग्रीष्मजमभ्रकाले । घनात्यये वार्षिकमाशु सम्यक् प्राप्नोति रोगानृतुजान्न जातु ॥
॥ ३६ ॥ नित्यं हिताहारविहारसेवी समीक्ष्यकारी विषयेष्वसक्तः । दाता समः सत्यपरः क्षमावानाप्तोपसेवी च भवत्यरोगः ॥`
        .split('\n').forEach(async (str, idx) => {
        console.log(idx + ':str:' + str);
    })
}

// main()